In [1]:
## Standard Imports
import numpy as np
import pandas as pd
import os, time, json
import sqlalchemy
from sqlalchemy import create_engine
pd.set_option('display.max_columns',50)

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Use read_csv in a list comprehension and combine with concat to load all files
df = pd.read_csv('Data/title.basics-cleaned.tsv.gz')
df.head()

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [4]:
df = df.drop(columns = ['Unnamed: 0'])

## Getting a list of Unique Genres

In [5]:
## Creating a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
86974,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
86975,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86976,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [6]:
# Exploding the df to create rows for each genre
exploded_genres = df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
86977,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
86978,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [7]:
# Getting all the unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())

## Creating the title_genres table

In [8]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Creating a genre mapper dictionary

In [9]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [10]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

## Using the mapper to replace the strings with integer ids

In [11]:
## make new integer genre_id and drop string genres
df['genre_id'] = df['genres_split'].replace(genre_map)
df = df.drop(columns='genres_split')

## Convert the fenre map dicitoanry into a dataframe

In [12]:
genre_lookup = pd.DataFrame({'Genre_Name' : genre_map.keys(),
                            'Genre_ID' : genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [13]:
genre_lookup.to_sql('genres', conn, if_exists='replace', index=False)

25

In [14]:
title_genres.to_sql('title_genres', conn, if_exists='replace', index=False)

162600

# Creating MYSQL tables with a primary key using Python

In [15]:
import glob
# Use glob to get all filepaths that match the pattern (*=wildcard)
tmdb_files = sorted(glob.glob("Data/final_tmdb_data*.csv.gz"))
tmdb_files

['Data\\final_tmdb_data_2001.csv.gz',
 'Data\\final_tmdb_data_2002.csv.gz',
 'Data\\final_tmdb_data_2010.csv.gz']

In [16]:
# Use read_csv in a list comprehension and combine with concat to load all files
tmdb = pd.concat([pd.read_csv(f) for f in tmdb_files] )

In [17]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6725 entries, 0 to 2731
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                6725 non-null   object
 1   adult                  6722 non-null   float64
 2   backdrop_path          3767 non-null   object
 3   belongs_to_collection  507 non-null    object
 4   budget                 6722 non-null   float64
 5   genres                 6722 non-null   object
 6   homepage               1115 non-null   object
 7   id                     6722 non-null   float64
 8   original_language      6722 non-null   object
 9   original_title         6722 non-null   object
 10  overview               6566 non-null   object
 11  popularity             6722 non-null   float64
 12  poster_path            5996 non-null   object
 13  production_companies   6722 non-null   object
 14  production_countries   6722 non-null   object
 15  release_date           6630 non-null   object
 16  revenue                6722 non-null   float64
 17  runtime                6722 non-null   float64
 18  spoken_languages       6722 non-null   object
 19  status                 6722 non-null   object
 20  tagline                2784 non-null   object
 21  title                  6722 non-null   object
 22  video                  6722 non-null   float64
 23  vote_average           6722 non-null   float64
 24  vote_count             6722 non-null   float64
 25  certification          2023 non-null   object
dtypes: float64(9), object(17)
memory usage: 1.4+ MB

In [18]:
tmdb.dtypes

imdb_id                   object
adult                    float64
backdrop_path             object
belongs_to_collection     object
budget                   float64
genres                    object
homepage                  object
id                       float64
original_language         object
original_title            object
overview                  object
popularity               float64
poster_path               object
production_companies      object
production_countries      object
release_date              object
revenue                  float64
runtime                  float64
spoken_languages          object
status                    object
tagline                   object
title                     object
video                    float64
vote_average             float64
vote_count               float64
certification             object
dtype: object

In [19]:
tmdb_data = tmdb.drop(columns=['adult', 'backdrop_path', 'belongs_to_collection', 'genres',
                                    'homepage', 'id', 'original_language', 'runtime', 'spoken_languages', 'status',
                                    'tagline', 'title', 'video', 'vote_average', 'vote_count'])

In [20]:
tmdb_data = tmdb_data.drop(columns=['original_title', 'overview', 'popularity', 'poster_path', 'production_companies',
                                    'production_countries', 'release_date'])

In [21]:
tmdb_data.duplicated().sum()

1352

In [22]:
tmdb_data = tmdb_data.drop_duplicates()

In [23]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb['imdb_id'].fillna('').map(len).max()
cert_len = tmdb['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": CHAR(key_len+1), 
    "budget": FLOAT(),
    "revenue": FLOAT(),
    'certification':CHAR(cert_len+1)}

In [24]:
tmdb_data.to_sql('tmdb_data', conn, if_exists='replace', index=False)

5373

## Run df.to_sql with the dtype argument.

In [25]:
q = """SHOW TABLES

"""""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [26]:
q = """ SELECT *
FROM genres
LIMIT 5
"""""
pd.read_sql(q, conn)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [27]:
q = """ SELECT *
FROM title_genres
LIMIT 5
"""""
pd.read_sql(q, conn)

      tconst genres_split
0  tt0035423       Comedy
1  tt0035423      Fantasy
2  tt0035423      Romance
3  tt0062336        Drama
4  tt0069049        Drama

In [28]:
q = """SELECT *
FROM tmdb_data
LIMIT 5

"""""
pd.read_sql(q, conn)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019048.0         PG-13
2  tt0114447         0.0         0.0          None
3  tt0116916         0.0         0.0            PG
4  tt0118589  22000000.0   5271666.0         PG-13

In [29]:
tmdb_data['imdb_id'].duplicated().sum()

0